#+TITLE： 硕士毕业论文日志
#+AUTHOR： 王勇
#+EMAIIL: yungwong.seu@gmail.com
#+STARTUP: indent

* 随笔
*** <2017-04-07 Fri>
今天折腾了开源的「思源宋体」字体，并将其设置为了 Spacemacs 默认的中文显示字体
相比于「微软雅黑」字体，「思源宋体」字体显得更为清淡，看起来更为舒服。

笔记本的键盘太破旧了，按着不舒服，以后要买一副机械键盘。

*** <2017-04-08 Sat>
上午初步勾勒了「论文主要工作」的内容，后续润色未完成。

论文的书写不是一蹴而就的，需要先将逻辑线描述出来（大纲），逻辑线带出关键点。
具体的关键点，自成一体，也需内部的逻辑线支撑。
当逻辑网明确后，用准确精简的文字具体介绍。

以「问题」为核心，清楚介绍研究工作要解决什么问题。
方法论：综述解决「问题」的现有研究方法，重点介绍自己采用的研究方法及其创新点。

看了 1998 年押井守监制的「攻壳机动队」，有很多的哲学思辨。

*** <2017-04-10 Mon>
今天让导师看论文被骂了，好像是我偷走了徐博的研究思路。
吕老师对优先权特别看重。

幸好我想到了开题报告里写了考虑龙卷风移动效应，
不然不知道被骂到什么时候。

先把东西做出来，即使粗糙一些也无所谓，做出成果投出去，
在论文审核的时候可以把问题做精细。

论文独创的方向很重要，可我觉得一个问题做深做精也很有价值啊。

吕老师说我形成了固定的思路，理解不了他的思路，本来每个人的思路就不一样啊。

* 大论文
** todo
*** DONE 摘要；论文主要工作；本章引言、小结
CLOSED: [2017-03-27 Mon 15:27]
章节引言主要是介绍目前的研究现状，可引用参考论文中的文章主要工作。

*** DONE 改写 _本课题主要研究内容_ 根据[[吕老师建议]]
CLOSED: [2017-04-10 Mon 18:15]
确定逻辑线，然后再把各个点介绍清楚。

*** TODO _总结与展望_
*** TODO _ABSTRACT_ 摘要翻译
*** TODO _绪论课题研究背景及意义_ 增加龙卷风介绍
*** DONE _计算流体动力学基本理论_ 增加湍流模型
CLOSED: [2017-04-05 Wed 10:05]
:LOGBOOK:
CLOCK: [2017-04-05 Wed 09:55]--[2017-04-05 Wed 10:05] =>  0:10
:END:
介绍的是 k-\epsilon 模型，实际使用的是 k-\omega 模型。
需要补充 k-\omega 模型的介绍吗？

*** DONE _龙卷风数值模拟结果及其正确性验证_
CLOSED: [2017-04-05 Wed 15:57]
:LOGBOOK:
CLOCK: [2017-04-05 Wed 10:31]--[2017-04-05 Wed 10:56] =>  0:25
:END:
切向速度云图、切向速度径向变化图、风压云图 etc 增加与 Rankine 涡模型的对比 
重新绘制切向速度在轴向剖面、水平剖面的云图。
切向速度径向变化图增加与 Rankine 涡的对比。
重新绘制风压在轴向剖面、水平剖面的云图。

*** DONE 单向流固耦合方法介绍 
CLOSED: [2017-04-06 Thu 09:25]
参考论文中的介绍。
参考原来报告中单向流固耦合的介绍，略显简单（平时多写报告是很有用的）。

*** DONE _FSI 方法与规范方法的对比_ 增加结果分析
CLOSED: [2017-04-05 Wed 17:00]
增加了与小论文相同的结果分析，但看起来仍然较少。

*** DONE _输电塔结构动力时程分析_ 增加结果分析
CLOSED: [2017-04-06 Thu 15:58]
插图中文字过大，尝试将图片尺寸设为默认。
默认尺寸中图形中文字仍然偏大，思考如何能控制图片中文字的大小。
参考龙卷风动态作用的论文。
=考虑龙卷风动态效应需要叠加风场移动速度吗？=

*** DONE _致谢_
CLOSED: [2017-04-08 Sat 14:59]
感谢导师，设计院图纸
感谢同课题组同学
感谢朋友
感谢家人
感谢开源软件及其社区维护，emacs, latex, python

*** DONE _作者简介_ 
CLOSED: [2017-04-08 Sat 14:26]
要加入校庆论文吗？
个人介绍「成绩优秀」？

*** DONE 插入附录程序
CLOSED: [2017-04-06 Thu 15:57]
AucTeX 配合 minted 宏包和-shell-escape 编译选项插入程序代码。

*** TODO 增加文献引用
主要在引言部分增加参考文献引用。

** 吕老师建议
:LOGBOOK:
CLOCK: [2017-03-27 Mon 21:40]--[2017-04-05 Wed 09:54] => 204:14
:END:
*** 本课题主要研究内容！
- 指出目前研究的不足之处，存在的主要问题。
- 针对目前研究的某个具体的不足之处，总结自己解决了什么问题，
  采取了什么技术路线（按重要程度排序，不一定按照实际的章节顺序）。
- 介绍 XX 理论 -> 应用 XX 理论解决 XX 问题。
  
** 吕老师建议二
- 论文主要工作「单向流固耦合方法」的提出没有严格因果关系。
- 重点为每章小结。
- 同课题组同届课题要尽量避开，不能剽窃别人的研究思路。 

** 论文主要工作 
输电塔结构是空间格构式塔架，其风荷载采用体型系数法确定存在如下缺点：
体型系数较难确定（杆件分布复杂、挡风效应 等）

本文采用单向流固耦合方法计算格构式塔架受到的龙卷风荷载，难点如下：
- 流场网格划分复杂；
- CFD 计算得到的风压施加到有限元模型；
- 模拟足尺龙卷风数值风场。

难点一：流场网格划分复杂
解决方法：仅将输电塔主体框架在 CFD 计算流域中建模。
理由：次要构件（如支撑等）截面尺寸较小，挡风效应较小，考虑以体型系数法计算风荷载。

难点二：CFD 计算得到的风压施加到有限元模型
解决方法：输电塔有限元模型采用梁单元，编制程序将 CFD 计算得到的风压转化为梁单元节点集中力
理由：采用壳单元模拟输电塔构件可较容易实现 CFD 风场风压映射到有限元网格，但这种方法计算量较大。

难点三：模拟足尺龙卷风数值风场
解决方法：通过比较龙卷风缩尺数值风场和实测风场引入长度相似比和速度相似比，并利用这两个相似比将缩尺风场改造成足尺风场（利用长度相似比将缩尺风场的计算流域放大；利用速度相似比将缩尺风场的入口风速放大）

为了比单向流固耦合方法进行比较，还介绍了利用规范中风荷载计算公式计算龙卷风荷载的方法

准静态响应，参数化分析

动态响应

* 小论文：龙卷风作用下大跨越输电塔结构的静态响应分析
** 结果分析
*** DONE 准备 0 度、45 度和 90 度分析工况；
单向流固耦合分析工况中，选择 30 度结果代替 0 度，选择 75 度结果代替 90 度。

*** DONE 选取关键构件单元编号
CLOSED: [2017-03-27 Mon 19:04]
利用 ANSYS Meshing 和 Named Selection 提取单元编号。
单元根据梁、柱、支撑和位置（base, mid, arm, etc.)分类，并选取 X 向和 Y 向。
提取的单元较多，故需要在每个典型位置选取一个单元作为代表。

*** DONE 后处理提取关键单元轴向内力
CLOSED: [2017-03-27 Mon 19:05]
利用*GET 命令提取各单元的轴向力。
#+BEGIN_SRC apdl
*GET,Par,ELEM,N,SMISC,Snum
#+END_SRC
编制 APDL 后处理程序，将选取单元的轴向压力写入 CSV 格式的文件。

选取的单元编号需要满足如下条件：
- 采用 FSI 和 CODE 方法计算的结果差别较小；
- 存在 45 度为危险工况的单元；
- 选取单元分别处于不同的位置和方向。

